Javascript-JQuery/myrottenpotatoes/app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    @ratings_to_show = params[:ratings] || @all_ratings

    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (UPPER(rating) IN ('G','PG','PG-13','R'))

  def create
    if (@movie = Movie.create(movie_params))
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "T"], ["rating", "G"], ["description", nil], ["release_date", "2023-10-31 00:00:00"], ["created_at", "2023-10-31 01:22:13.195627"], ["updated_at", "2023-10-31 01:22:13.195627"]]